"""
Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в один рядок через кому. Отримайте для масиву
середнє арифметичне.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
    masive = np.array([int(input("Введіть елемент: ")) for i in range(5)])  # Задаємо масив
    print("Елементи масиву: ", list(masive))  # Розтавимо коми за допомогою list
    print("Середнє арифметичне елементів: ", masive.mean())
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break