"""
Дані про температуру повітря за декаду листопада зберігаються в масиві. Визначити, скільки разів температура
опускалася нижче -10 градусів.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import randint  # Імпортуємо рандом
while True:
    masive = np.array([randint(-42, 42) for i in range(10)])  # Генерація масиву
    print("Згенерований масив: ", masive)
    print(f'Кількість знижень температури за -10 градусів: ', sum(i < -10 for i in masive))  # Виводимо кількіть знижень температури
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break