"""
Дані про температуру води на Чорноморському узбережжі за декаду вересня зберігаються в масиві. Визначити, скільки
за цей час було днів, придатних для купання..
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import randint  # Імпортуємо рандом
while True:
    masive = np.array([randint(9, 29) for i in range(10)])  # Генерація масиву
    print("Згенерований масив: ", masive)
    print("Кількість днів придатних для купання: ", sum(i >= 18 for i in masive))
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break