"""
Знайти суму парних елементів масиву цілих чисел. Розмірність масиву - 20. Заповнення масиву здійснити випадковими
числами від 100 до 200.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import randint  # Імпортуємо рандом
while True:
    masive = np.array([randint(100, 200) for i in range(20)])  # Генерація масиву
    print("Згенерований масив: ", masive)  # Виведення масиву
    sum = 0
    for i in masive:
        if i % 2 == 0:  # Пошук парних елементів
            sum += i
    print("Сума парних елементів: ", sum)
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break