"""
Знайти суму елементів масиву дійсних чисел, що мають непарні номери. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 100 до 200
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import randint  # Імпортуємо рандом
while True:
        masive = np.array([randint(100, 200) for i in range(20)])  # Генерація масиву
        print("Згенерований масив: ", masive)
        a = 0
        for i in range(0, len(masive), 2):  # Пошук елементів з непарним номером
                a += masive[i]  # Знаходження суми непарних елементів
        print("Сума непарних елементів: ", a)
        result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
        if result == '1':
                continue
        else:
                break
