"""
Знайти суму всіх елементів масиву цілих чисел що задовольняють умові: остача від ділення на 2 дорівнює 3. Розмірність
масиву - 20. Заповнення масиву здійснити випадковими числами від 200 до 300.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import randint  # Імпортуємо рандом
while True:
    masive = np.array([randint(200, 300) for i in range(20)])  # Генерація масиву
    print("Створений масив: ", masive)
    a = 0
    if a!=0:  # Пошук чисел у яког остача від ділення на 2 дорівнює 3
        for i in masive:
            if (i % 2) == 3:
                a += i
        print("Сума елементів, остача від ділення яких на 2 дорівнює 3: ", a)
    else:
        print("Елементів в який остача від ділення числа на 2 дорівнює 3 НЕМАЄ ")
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break
