"""
Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть на екран значення коріння і квадратів кожного з
елементів масиву.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from math import sqrt  # Імпортумо корінь із бібліотеки math
while True:
    masive = np.array([int(input("Введіть елемент: ")) for i in range(5)])  # Задаємо масив
    print("Квадратні корені елементів масиву: ", list(map(lambda x: sqrt(x), masive)))  # За допомогою map проводимо операції над елементами масиву
    print("Квадрати елементів масиву: ", list(map(lambda x: x * x, masive)))  # Використовуючи тимчасову функцію lambda
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break