"""
Знайти суму всіх елементів масиву дійсних чисел, більших за задане число. Розмірність масиву - 20.
Заповнення масиву здійснити випадковими числами від 50 до 100.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import randint  # Імпортуємо рандом
while True:
    masive = np.array([randint(50, 100) for i in range(20)])  # Генерація масиву
    a = int(input("Введіть число: "))
    print("Згенерований масив: ", masive)
    sum = 0
    for i in masive:  # Пошук елементів що менше за задане
        if i > a:
            sum += i
    print("Сума елементів, більших за задане Вами: ", sum)
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break

