"""
Знайти добуток всіх елементів масиву дійсних чисел, менших заданого числа. Розмірність масиву - 10. Заповнення масиву
здійснити випадковими числами від 50 до 100.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import randint  # Імпортуємо рандом
while True:
    masive = np.array([randint(50, 100) for i in range(10)])  # Генерація масиву
    a = int(input("Введіть число: "))
    print("Згенерований масив: ", masive)
    prod = 1
    for i in masive:  # Пошук елементів менших за задане число
        if i < a:
            prod *= i
    if prod != 1:
        print("Добуток елементів : ", prod)
    else:
        print(f'Немає елементів менших за {a}')
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break