"""
Знайти суму всіх елементів масиву цілих чисел, які менше середнього арифметичного елементів масиву. Розмірність
масиву - 20. Заповнення масиву здійснити випадковими числами від 150 до 300.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import randint  # Імпортуємо рандом
while True:
    masive = np.array([randint(150, 300) for i in range(20)])  # Генерація масиву
    print("Згенерований масив: ", masive)
    sum = 0
    arithmetic_average = masive.mean()  # Пошук середнього арифметичного
    for i in masive:  # Пошук елементів що менше середнього арифметичного
        if i < arithmetic_average:
            sum += i
    print("Сума елементів які менше середнього арифметичного масиву: ", sum)
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break
