"""
Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8 одночасно. Розмірність масиву - 30.
Заповнення масиву здійснити випадковими числами від 500 до 1000.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import randint  # Імпортуємо рандом
while True:
    masive = np.array([randint(500, 1000) for i in range(30)])  # Генерація масиву
    print("Ваш масив: ", masive)
    sum = 0
    for i in masive:  # Пошук елементів кі діляться на 5 і на 8 одночасно
        if i % 5 == 0 and i % 8 == 0:
            sum += i
    if sum !=0:
        print("Сума елементів : ", sum)
    else:
        print("Сума елементів дорівнює 0")
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break
