"""
Напишіть програму аналізу значень температури хворого за добу: визначте мінімальне і максимальне значення,
середнє арифметичне. Заміри температури виробляються шість раз на добу і результати вводяться з клавіатури у масив T.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
      temp = np.array([float(input("Значення температури: ")) for i in range(6)])  # Створюємо масив
      print("Створений масив: ", temp)
      print(f"Мінімальна температура: {temp.min()}\n"
            f"Максимальная температура: {temp.max()}\n"
            f"Середня температура: {temp.mean()}")
      result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
      if result == '1':
            continue
      else:
            break