"""
Лінійний масив містить відомості про кількість опадів, що випали за кожен з 12 місяців одного року. Складіть програму,
що визначає загальну кількість опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
      precipitation = np.array([int(input(f"Кількість опадів впродовж {i} місяця: ")) for i in range(1, 13)])  # Створюємо масив
      print("Створений масив: ", precipitation)
      print(f"Найпосушливий місяць року: {precipitation.min()}\n"
            f"Кількість посушливих місяців: {sum(i < 30 for i in precipitation)}\n"
            f"Середньомісячна кількість опадів: {precipitation.mean()}\n"
            f"Загальна кількість опадів: {precipitation.sum()}")
      result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
      if result == '1':
            continue
      else:
            break
