"""
Знайти кількість парних елементів одновимірного масиву до першого зустрінутого числа рівного наперед заданому числу а.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
    a = int(input("Введіть остання число: "))
    masive = list(np.array([int(input(f"Введіть число: ")) for i in range(int(input("Введіть довжину масиву: ")))]))
    if a in masive:
        masive = masive[:masive.index(a)]  # Зрізаємо масив при зутрічі (а)
        print("Масив зрізаний до числа (а): ", masive)
    else:
        print("Вказаного числа немає в масиві")
    print(f"Кількість парних елементів: {sum(((i % 2) == 0) for i in masive)}")  # Пошук парних елементів
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break