"""
Обчислити середнє арифметичне значення тих елементів одновимірного масиву, які розташовані за першим по порядку
мінімальним елементом.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
    masive = list(np.array([int(input(f"Введіть число: ")) for i in range(int(input("Введіть довжину масиву: ")))]))  # Створюємо масив
    print("Створений масив: ", masive)
    masive = np.array(masive[:masive.index(min(masive)):-1][::-1])  # Знаходимо мінімальне число та зріз до першого мінімального з кінця
    if len(masive) == 0:
        print("Мінімальним елементом є останнє число")
    else:
        # Виведення масиву та середнього арифметичного масиву
        print("Зрізаний масив: ", masive)
        print("Середнє арифметичне елементів які знаходяться пілся першого введення мінімального значення: ", masive.mean())
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break