"""
Знайти суму додатніх елементів лінійного масиву цілих чисел. Розмірність масиву - 10. Заповнення масиву
здійснити з клавіатури.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
    masive = np.array([int(input(f"Введіть число масиву: ")) for i in range(10)])  # Створюємо масив
    print("Створений масив: ", masive)
    print("Сума додатніх чисел", sum(filter(lambda x: x > 0, masive)))  # Фільтруємо масив і знаходимо суму додатніх елементів
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break