"""
Дані про направлення вітру (північний, південний, східний, західний) і силі вітру за декаду листопада зберігаються
в масиві. Визначити, скільки днів дув південний вітер з силою, що перевищує 8 м / с.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import choice
from random import randint
while True:
    wind = ["Північний ", "Південний", "Східний", "Західний"]
    masive = np.array([[choice(wind), randint(0, 33)] for i in range(10)])  # Створюємо масив
    print("Створений масив: ", masive)
    print(sum(int(i[1]) > 8 for i in masive))  # Сума елементів більших 3 що є елементами кожної стрічки
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break