"""
Створіть масив з п'яти прізвищ і виведіть на екран ті з них, які починаються з певної букви, яка вводиться з клавіатури.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
    a = input("Введіть першу літеру: ")[:1]  # Вводимо потрібну першу літеру та виводимо ті прізвища які починаються на цю літеру
    for el in np.array([input('Введіть прізвище: ') for i in range(5)]):
        if el[0] == a:
            print(el)
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break