"""
Підрахуйте кількість елементів одновимірного масиву, які збігаються зі своїм номером і при цьому кратні 3..
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
    masive = np.array([int(input(f"Введіть число: ")) for i in range(int(input(f"Введіть довжину масиву: ")))])  # Створюємо масив
    print("Ваш масив: ", masive)
    count = 0  # Кількість елементів
    count_index = 0  # Лічильник індексів
    for i in masive:  # Пошук чисел кратних 3 і які збігаються зі своїм індексом
        if i == count_index and i % 3 == 0:
            count += 1
        count_index += 1
    print("Кількість елементів, що задовільняють умові: ", count)
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break
