"""
Задана таблиця назв товарів, що випускаються заводом. Визначте, чи повторюється в цій таблиці назва першого товару,
і, якщо повторюється, видаліть назву першого товару з таблиці.
Барбак Владислав Дмитрович 122В
"""
while True:
    list = [input("Введіть товар: ") for i in range(int(input("Введіть кількість товарів: ")))]  # Створюємо масив
    print("Товари ", list)
    if list[0] in list[1:]:
        list.remove(list[0])
    print("Новий список товарів: ", list)
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break