"""
Наведено список прізвищ брокерів товарної біржі з N чоловік. Поміняйте місцями прізвища брокерів: першого і останнього,
другого і передостаннього, третього з початку і третього від кінця і т.д.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
    massive = np.array([input("Введіть ім'я: ") for i in range(int(input("Введіть кількість імен: ")))])  # Створюємо масив
    print("Список прізвищ ", massive)
    print("Список переміщених прізвищ: ", massive[::-1])  # Перевертаємо масив
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break