"""
Створіть масив А [1..7] за допомогою генератора випадкових чисел і виведіть його на екран. Збільште всі його
елементи в 2 рази.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import randint  # Імпортуємо рандом
while True:
    a = int(input("Введіть найменше число: "))
    b = int(input("Введіть найбільше число: "))
    masive = np.array([randint(a, b) for i in range(7)])  # Генеруємо масив
    print("Згенерований масив: ", masive)  # Виводимо масив
    print("Згенерований масив де елементи помножені на 2: ", np.array([i * 2 for i in masive]))  # Масив де всі елементи помножені на 2
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break