"""
В масиві X (1: n) кожен елемент рівний 0, 1 або 5. Переставити елементимасиву так, щоб спочатку розташовувалися всі
нулі, потім все одиниці, а потім всі п'ятірки. Додаткового масиву не заводити.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
import random
while True:
    masive = sorted(np.array([random.choice([0, 1, 5]) for i in range(int(input("Введіть кількість елементів: ")))]))  # Створюємо масив
    print("Створений масив: ", masive)
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break