"""
Введіть масив з 20 елементів і визначте, чи є в ньому елементи з однаковими значеннями.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
    masive = sorted(np.array([int(input("Введіть число: ")) for i in range(20)]))  # Створюємо масив
    print("Створений масив: ", masive)
    masive2 = set(masive)  # Множина залишає лише унікальні елементи
    if len(masive) == len(masive2):
        print("Елементів з однаковими значеннями немає")
    else:
        print("Елементи з однаковими значеннями існують")
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break