"""
У будинку, що складається з 30 квартир, переселити мешканців так, щоб мешканці першої квартири переїхали в тридцяту,
з тридцятого - в першу, з другої - в 29 і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
    masive = np.array([int(input("Введіть кількість мешканців: ")) for i in range(30)])  # Створюємо масив
    print("Створений масив: ", masive)
    print("Переселення: ", masive[::-1])
    print("Кількість квартир з більше ніж 5 людей: ", sum(filter(lambda x: x > 5, masive)))
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break