"""
Дан одновимірний масив цілих чисел. Знайдіть, скільки разів в ньому повторюється найчастіше число.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
while True:
    masive = list(np.array([int(input("Введіть число: ")) for i in range(int(input("Введіть довжину масиву: ")))]))  # Створюємо масив
    print("Створений масив: ", masive)
    num = max(set(masive), key=masive.count)   # Перетворивши список у множину і використавши метод count для знаходження числа входжень елемента в список
    print(f"Стільки разів повторюється найчастіше число {num}: ", masive.count(num))
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break