"""
Створіть цілочисельний масив А [1..15] за допомогою генератора випадкових чисел з елементами від -15 до 30 і виведіть
його на екран. Визначте найбільший елемент масиву і його індекс.
Барбак Владислав Дмитрович 122В
"""
import numpy as np
from random import randint  # Імпортуємо рандом
while True:
    masive = np.array([randint(-15, 30) for i in range(12)])  # Генеруємо масив рандомних чисел від -15 до 30
    print("Ваш масив: ", masive)
    max = masive.max()  # Шукаємо максимальне число масиву
    print("Максимальний елемент масиву", max, "та його індекс: [", list(masive).index(max), "]")  # Виходимо максимальне число та його індекс
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break