"""
З 8 до 20 години температура повітря вимірювалася щогодини. Відомо, що протягом цього часу температура знижувалася.
Визначте, о котрій годині було вперше зафіксовано від'ємну температуру.
Барбак Владислав Дмитрович 122В
"""
from random import randint  # Імпортуємо рандом
while True:
    temp = randint(-42, 42)  # Найменша і найвища температура України
    flag = False
    for i in range(8, 21):  # Проходимо по годинам
        if temp < 0:  # Перевірка на мінусову температуру
            print(f"О {i} годині температура стане від'ємною")
            flag = True
            break
        temp -= int(input("Введіть на скільки падає температура через кожну годину: "))

        if temp < -42:
            temp = -42
    if not flag:
        print("Температура так і не стала мінусовою за чей час")
    result = input("Хочите продовжити? Якщо да - 1, Якщо ні - інше: ")  # Зациклюємо програму
    if result == '1':
        continue
    else:
        break